// =============================================================================
// Файл:    location_provider.dart
// Проект:  ParaFlight
// Версия:  0.1.0
// Цель:    Базовый интерфейс провайдера геолокации (GPS, BLE, Симулятор)
// Изменения:
//   0.1.0 - Первичная реализация
// =============================================================================
import 'location_entity.dart';

/// Базовый интерфейс для провайдеров геолокации (GPS, BLE, Симулятор)
abstract class LocationProvider {
  /// Поток с данными геолокации
  Stream<LocationEntity> get locationStream;
}
